Repository: PhilippKosarev/bmi
Catalog: po/*.po
Languages: es, fr, it, ru, uk, vi

source: You may bypass the Preferences dialog by using drag and drop to move a plugin from a location to another.
vi: Bạn có thể kéo thả plugin trực tiếp để di chuyển vị trí mà không cần mở hộp thoại Tùy chọn.

source: Configuring global hotkeys
vi: Cấu hình phím tắt toàn cục

source: Some elements in <app>Accerciser</app> may enable certain functionalities via hotkeys. An example is the <link xref="quick_select_plugin">Quick Select Plugin</link>. The hotkey combination for each functionality can be changed via the Preferences dialog, under the "Global Hotkeys" tab. Under this tab, you will find a list of all features for which hotkeys can be configured. Use the <cmd>Ctrl</cmd>, <cmd>Alt</cmd>, and <cmd>Shift</cmd> checkboxes to enable or disable these modifiers.
vi: Một số tính năng trong <app>Accerciser</app> có thể dùng phím tắt. Ví dụ là <link xref="quick_select_plugin">Plugin Chọn nhanh</link>. Tổ hợp phím cho mỗi tính năng có thể thay đổi được trong tab “Phím tắt toàn cục” của hộp thoại Tùy chọn. Tab này liệt kê mọi tính năng có thể gán phím tắt. Dùng các hộp kiểm <cmd>Ctrl</cmd>, <cmd>Alt</cmd>, <cmd>Shift</cmd> để bật/tắt phím điều khiển.

source: Configuring widget's highlighting
vi: Cấu hình đánh dấu widget

source: Some of <app>Accerciser</app>'s elements, such as the global hotkey <keyseq><key>Ctrl</key><key>Alt</key><key>/</key></keyseq>, highlight a specific widget in a target application. The highlighting duration, border color, and fill color can be customized via the Preferences dialog, under the "Highlighting" tab.
vi: Một số tính năng của <app>Accerciser</app>, ví dụ phím tắt toàn cục <keyseq><key>Ctrl</key><key>Alt</key><key>/</key></keyseq>, sẽ đánh dấu một widget cụ thể trong ứng dụng mục tiêu. Thời gian đánh dấu, màu viền và màu tô có thể tùy chỉnh trong tab “Đánh dấu” của hộp thoại Tùy chọn.

# sort
source: 5. Quick Select Plugin
vi: 5. Plugin Chọn nhanh

source: Locating the object you need
vi: Tìm nhanh đối tượng cần thiết

source: Quick Select Plugin
vi: Plugin Chọn nhanh

source: The Quick Select Plugin does not provide a visible interface like the other default <app>Accerciser</app> plugins - instead, it adds facilities for quickly selecting items in the <link xref="desktop_tree_view">Application Tree View</link> via global hotkeys. Originally, these hotkeys were part of <app>Accerciser</app>'s core code, turning into the Quick Select Plugin later.
vi: Plugin Chọn nhanh không có giao diện hiển thị như các plugin mặc định khác – nó chỉ cung cấp phím tắt toàn cục để nhanh chóng chọn mục trong <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link>. Ban đầu các phím tắt này nằm trong mã nguồn lõi của <app>Accerciser</app>, sau được tách thành plugin riêng.

source: The Quick Select Plugin provides two global hotkeys. Pressing <keyseq><key>Ctrl</key><key>Alt</key><key>A</key></keyseq> selects the last focused accessible widget in the Application Tree View. Pressing <keyseq><key>Ctrl</key><key>Alt</key><key>/</key></keyseq> selects the accessible widget under the pointer in the Application Tree View and highlights it in the target application.
vi: Plugin Chọn nhanh cung cấp hai phím tắt toàn cục. Nhấn <keyseq><key>Ctrl</key><key>Alt</key><key>A</key></keyseq> để chọn widget trợ năng cuối cùng nhận tiêu điểm. Nhấn <keyseq><key>Ctrl</key><key>Alt</key><key>/</key></keyseq> để chọn widget dưới con trỏ chuột và đánh dấu nó trong ứng dụng mục tiêu.

# sort
source: 3. Validator Default Plugin
vi: 3. Plugin Xác thực mặc định

source: Testing an application for accessibility
vi: Kiểm tra khả năng trợ năng của ứng dụng

source: AT-SPI Validator Plugin
vi: Plugin Xác thực AT-SPI

source: The AT-SPI Validator Plugin generates a report with accessibility issues related to a target application. For each error, the report includes the severity level and a brief description.
vi: Plugin Xác thực AT-SPI tạo báo cáo về các vấn đề trợ năng của ứng dụng mục tiêu. Mỗi lỗi đều có mức độ nghiêm trọng và mô tả ngắn gọn.

source: The AT-SPI Validator Plugin generates useful reports for verifying the accessibility of a target application.
vi: Plugin Xác thực AT-SPI tạo báo cáo hữu ích để kiểm tra khả năng trợ năng của ứng dụng mục tiêu.

source: Running the AT-SPI Validator Plugin
vi: Chạy Plugin Xác thực AT-SPI

source: To run the AT-SPI Validator Plugin, select an item in the Application Tree View. The validator will generate the report with respect to the selected item and all of its descendant widgets in the tree hierarchy.
vi: Để chạy Plugin Xác thực AT-SPI, chọn một mục trong Khung nhìn cây ứng dụng. Báo cáo sẽ được tạo dựa trên mục đã chọn và toàn bộ widget con của nó trong cấu trúc cây.

source: After selecting an item, choose a validation schema in the combobox and press the <cmd>Validate</cmd> button to start generating the report. If you want to cancel the execution, just press the <cmd>Validate</cmd> button again.
vi: Sau khi chọn mục, chọn một schema xác thực trong hộp chọn rồi nhấn nút <cmd>Xác thực</cmd> để bắt đầu tạo báo cáo. Để hủy, nhấn lại nút <cmd>Xác thực</cmd>.

source: The generated report is interactive. Therefore, you can double-click any error found to check which of the target application widgets is causing it. The corresponding widget will then appear selected in the <link xref="desktop_tree_view"> Application Tree View</link> and highlighted in the target application.
vi: Báo cáo được tạo ra là tương tác. Bạn có thể nhấp đúp vào bất kỳ lỗi nào để xem widget nào của ứng dụng mục tiêu đang gây ra lỗi đó. Widget tương ứng sẽ được chọn trong <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link> và được đánh dấu trong ứng dụng mục tiêu.

source: If you want to save the generated report in your system, just click the <cmd>Save</cmd> button. To clear the validation screen, press the <cmd>Clear</cmd> button.
vi: Để lưu báo cáo, nhấn nút <cmd>Lưu</cmd>. Để xóa màn hình xác thực, nhấn nút <cmd>Xóa</cmd>.

source: To get more information about an error in the generated report, make sure the corresponding item is selected and press the <cmd>Help</cmd> button. It will open a Help Page in your default browser.
vi: Để xem thông tin chi tiết về một lỗi trong báo cáo, chọn lỗi đó rồi nhấn nút <cmd>Trợ giúp</cmd>. Trang trợ giúp sẽ mở trong trình duyệt mặc định.

source: Calculate body mass index
es: Calcule su índice de masa corporal
fr: Calculer l'indice de masse corporelle
it: Calcola l'indice di massa corporea
ru: Вычисление индекса массы тела
uk: Обчислення індексу маси тіла

source: GTK;body;mass;index;calculator
es: GTK;índice;de;masa;corporal;calculadora
fr: GTK;corps;masse;indice;calculateur
it: Calcolatore;indice;massa;corporea;GTK
uk: GTK;тіло;маса;індекс;калькулятор

source: Body mass index calculator
es: Calculadora del índice de masa corporal
fr: Calculateur d'indice de masse corporelle
it: Calcolatore dell'indice di massa corporea
ru: Калькулятор индекса массы тела
uk: Калькулятор індексу маси тіла

source: BMI is an open-source, body mass index calculator built with GTK4 and LibAdwaita.
es: BMI es una calculadora de índice de masa corporal de código abierto creada con GTK4 y LibAdwaita.
fr: IMC est un calculateur d'indice de masse corporelle open-source conçu avec GTK4 et LibAdwaita.
it: BMI è un calcolatore dell'indice di massa corporea open source, sviluppato con GTK4 e LibAdwaita.
ru: BMI — это калькулятор индекса массы тела с открытым исходным кодом, построенный с помощью GTK4 и LibAdwaita
uk: ІМТ — це калькулятор індексу маси тіла з відкритим кодом, побудований за допомогою GTK4 та LibAdwaita.

source: BMI Basic Mode Dark Theme
es: BMI Modo básico Tema oscuro
fr: IMC Mode Basique Thème Sombre
it: Tema scuro in modalità base BMI
ru: BMI Базовый режим Тёмная тема
uk: ІМТ Спрощений режим Темна тема

source: BMI Basic Mode Light Theme
es: BMI Modo básico Tema claro
fr: IMC Mode Basique Thème Clair
it: Tema chiaro della modalità base BMI
ru: BMI Базовый режим Светлая тема
uk: ІМТ Спрощений режим Світла тема

source: BMI Advanced Mode Dark Theme
es: BMI Modo avanzado Tema oscuro
fr: IMC Mode Avancé Thème Sombre
it: Tema scuro in modalità avanzata BMI
ru: BMI Расширенный режим Тёмная тема
uk: ІМТ Розширений режим Темна тема

source: BMI Advanced Mode Light Theme
es: BMI Modo avanzado Tema claro
fr: IMC Mode Avancé Thème Clair
it: Tema chiaro della modalità avanzata BMI
ru: BMI Расширенный режим Светлая тема
uk: ІМТ Розширений режим Світла тема

source: Forget height and weight on quit
es: Olvidar la altura y el peso al salir

source: Whether the app uses metric or imperial units
es: Si la aplicación utiliza unidades métricas o imperiales
fr: Indique si l'application utilise les unités métriques ou impériales
it: Se l'app utilizza unità di misura metriche o imperiali
ru: В приложении доступны как метрические, так и имепрские единицы
uk: Чи використовує програма метричні чи імперські одиниці вимірювання

source: Height in centimetres or inches
es: Altura en centímetros o pulgadas
fr: Taille en centimètres ou en pouces
it: Altezza in centimetri o pollici
ru: Рост в сантиметрах или дюймах
uk: Висота в сантиметрах або дюймах

source: Weight in kilograms or pounds
es: Peso en kilogramos o libras
fr: Poids en kilogrammes ou en livres
it: Peso in chilogrammi o libbre
ru: Вес в килограмах или фунтах
uk: Вага в кілограмах або фунтах

source: Toggles Advanced mode
es: Activa/Desactiva el modo avanzado

source: Years since birth
es: Años desde el nacimiento
fr: Années depuis la naissance
it: Anni dalla nascita
ru: Количество полных лет
uk: Років з дня народження

source: Biological gender
es: Género biológico
fr: Sexe biologique
it: Genere biologico
ru: Биологический пол
uk: Біологічна стать

source: Waist circumference in centimeters
es: Circunferencia de la cintura en centímetros
fr: Tour de taille en centimètres
it: Circonferenza della vita in centimetri
ru: Обхват талии в сантиметрах
uk: Обхват талії в сантиметрах

source: Hip circumference in centimeters
es: Circunferencia de la cadera en centímetros
fr: Tour de hanches en centimètres
it: Circonferenza dell'anca in centimetri
ru: Обхват бёдер в сантиметрах
uk: Обхват стегон у сантиметрах

source: Show About
es: Mostrar acerca de

source: Switch to imperial units
es: Cambiar a unidades imperiales

source: Forget input values after closing
es: Olvidar los valores introducidos tras cerrar

source: Inputs
es: Entradas
fr: Entrées
it: Input
ru: Ввод
uk: Введення

source: Height
es: Altura
fr: Taille
it: Altezza
ru: Рост
uk: Зріст

source: Weight
es: Peso
fr: Poids
it: Peso
ru: Вес
uk: Вага

source: Advanced inputs
es: Entradas avanzadas
fr: Entrées avancées
it: Input avanzati
ru: Продвинутый ввод
uk: Розширені введення

source: Gender
es: Género
fr: Sexe
it: Genere
ru: Пол
uk: Стать

source: Affects healthy/unhealthy thresholds for Waist to Hip ratio
es: Afecta a los umbrales saludables/no saludables para la relación cintura-cadera
fr: Affecte les seuils sain/malsain pour le rapport Taille/Hanches
it: Influisce sulle soglie sane/non sane per il rapporto vita-fianchi
ru: Влияет на здоровые/нездоровые пороговые значения соотношения талии и бёдер
uk: Впливає на здорові/нездорові пороги співвідношення талії до стегон

source: Average
es: Promedio
fr: Moyen
it: Media
ru: Среднее
uk: Середнє

source: Female
es: Mujer
fr: Femme
it: Donna
ru: Женщина
uk: Жінка

source: Male
es: Hombre
fr: Homme
it: Uomo
ru: Мужчина
uk: Чоловік

source: Age
es: Edad
fr: Âge
it: Età
ru: Возраст
uk: Вік

source: Affects healthy/unhealthy thresholds for Waist to Height ratio
es: Afecta a los umbrales saludables/no saludables para la relación cintura-altura
fr: Affecte les seuils sain/malsain pour le rapport Taille/Hauteur
it: Influisce sulle soglie sane/non sane per il rapporto vita-altezza
ru: Влияет на здоровые/нездоровые пороговые значения соотношения талии и роста
uk: Впливає на здорові/нездорові пороги співвідношення талії до зросту

source: Waist
es: Cintura
fr: Tour de taille
it: Vita
ru: Талия
uk: Талія

source: Affects Waist to Height ratio, Waist to Hip ratio and BRI
es: Afecta a la relación cintura-altura, la relación cintura-cadera y el IRC
fr: Affecte le rapport Taille/Hauteur, le rapport Taille/Hanches et l'IRC
it: Influisce sul rapporto vita-altezza, sul rapporto vita-fianchi e sul BRI
ru: Влияет на соотношение талии к росту, талии к бёдрам и ИОТ
uk: Впливає на співвідношення талії до зросту, співвідношення талії до стегон та ІОТ

source: Hip
es: Cadera
fr: Hanches
it: Anca
ru: Бёдра
uk: Стегно

source: Affects Waist to Hip ratio
es: Afecta a la relación entre la cintura y la cadera
fr: Affecte le rapport Taille/Hanches
it: Influisce sul rapporto vita-fianchi
ru: Влияет на соотношение талии к бёдрам
uk: Впливає на співвідношення талії та стегон

source: BMI:
es: IMC:

source: Copy BMI
es: Copiar IMC

source: Results
es: Resultados
fr: Résultats
it: Risultati
ru: Результаты
uk: Результати

source: Body Mass Index
es: Índice de masa corporal
fr: Indice de Masse Corporelle
it: Indice di massa corporea
ru: Индекс массы тела
uk: Індекс Маси Тіла

source: Waist / Height
es: Cintura / Altura
fr: Taille / Hauteur
it: Vita / Altezza
ru: Талия / Рост
uk: Талія / Зріст

source: Waist to height ratio
es: Relación entre la cintura y la altura
fr: Rapport taille/hauteur
it: Rapporto vita-altezza
ru: Отношение талии к росту
uk: Співвідношення талії до зросту

source: Waist / Hip
es: Cintura / Cadera
fr: Tour de taille / Hanches
it: Vita / Fianchi
ru: Талия / Бёдра
uk: Талія / Стегна

source: Waist to hip ratio
es: Relación entre cintura y la cadera
fr: Rapport tour de taille/hanches
it: Rapporto vita-fianchi
ru: Отношение талии к Бёдрам
uk: Співвідношення талії до стегон

source: BRI
es: IRC
fr: IRC
ru: ИОТ
uk: ІОТ

source: Body Roundness Index
es: Índice de redondez corporal
fr: Indice de Rondeur Corporelle
it: Indice di rotondità del corpo
ru: Индекс округлости тела
uk: Індекс Округлості Тіла

source: Centimetres
es: Centímetros
fr: Centimètres
it: Centimetri
ru: Сантиметры
uk: Сантиметрів

source: Kilograms
es: Kilogramos
fr: Kilogrammes
it: Chilogrammi
ru: Килограммы
uk: Кілограмів

source: Inches
es: Pulgadas
fr: Pouces
it: Pollici
ru: Дюймы
uk: Дюймів

source: Pounds
es: Libras
fr: Livres
it: Libbre
ru: Фунты
uk: Фунтів

source: Underweight
es: Bajo peso

source: Healthy
es: Saludable
fr: Sain
it: Sano
ru: Здоровый
uk: Здоровий

source: Overweight
es: Sobrepeso
fr: Surpoids
it: Sovrappeso
ru: Избыток веса
uk: Надлишкова вага

source: Obese
es: Obeso
fr: Obésité
it: Obeso
ru: Ожирение
uk: Ожиріння

source: Extremely obese
es: Extremadamente obeso

source: Underweight [Severe]
es: Bajo peso [grave]
fr: Maigreur[Sévère]
it: Sottopeso [Grave]
ru: Недостаточный вес [Выраженный]
uk: Недостатня вага [Виражена]

source: Underweight [Moderate]
es: Bajo peso [Moderado]
fr: Maigreur [Modérée]
it: Sottopeso [Moderato]
ru: Недостаточный вес [Умеренный]
uk: Недостатня вага [Помірна]

source: Underweight [Mild]
es: Bajo peso [Leve]
fr: Maigreur [Légère]
it: Sottopeso [Lieve]
ru: Недостаточный вес [Незначительный]
uk: Недостатня вага [Незначна]

source: Obese [Class 1]
es: Obesidad [Clase 1]
fr: Obésité [Classe 1]
it: Obeso [Class 1]
ru: Ожирение [Класс 1]

source: Obese [Class 2]
es: Obesidad [Clase 2]
fr: Obésité [Classe 2]
it: Obeso [Class 2]
ru: Ожирение [Класс 2]
uk: Ожиріння [II ступеню]

source: Obese [Class 3]
es: Obesidad [Clase 3]
fr: Obésité [Classe 3]
it: Obeso [Class 3]
ru: Ожирение [Класс 3]
uk: Ожиріння [III ступеню]

source: Unhealthy
es: Poco saludable
fr: Malsain
it: Malsano
ru: Нездоровый
uk: Нездоровий

source: Very lean
es: Muy magro
fr: Très mince
it: Molto magro
ru: Очень худой
uk: Дуже худий

source: Result copied
es: Resultado copiado
fr: Résultat copié
it: Risultato copiato
ru: Результат скопирован
uk: Результат скопійовано

source: Lean
es: Magro
fr: Mince
it: Magro
ru: Худой
uk: Худий

source: Above average
es: Por encima del promedio
fr: Au-dessus de la moyenne
it: Sopra la media
ru: Выше среднего
uk: Вище середнього

source: High
es: Alto
fr: Élevé
it: Alto
ru: Высокий
uk: Високий

source: Basic
es: Básico

source: Advanced
es: Avanzado

source: Affects BMI and BRI
es: Afecta al IMC y al BRI
fr: Affecte l'IMC et l'IRC
it: Influisce sull'IMC e sul BRI
uk: Впливає на ІМТ та ІОТ

source: Affects BMI
es: Afecta al IMC
fr: Affecte l'IMC
it: Influisce sull'IMC
uk: Впливає на ІМТ

source: Years
es: Años
fr: Années
it: Anni
uk: Років

source: Copy result
es: Copiar resultado

source: Window size
es: Tamaño de la ventana
fr: Taille de la fenêtre
it: Dimensioni della finestra
uk: Розмір вікна

source: Toggles Advanced Mode
es: Activa/Desactiva el modo avanzado
fr: Active/Désactive le mode avancé
it: Attiva la modalità avanzata

source: Remember inputs
es: Recordar entradas
fr: Mémoriser les entrées
it: Ricorda input
uk: Запам'ятати введені дані

source: Translators
es: Traductores
fr: Traducteurs
it: Traduttori
uk: Перекладачі

source: Preferences
es: Preferencias
fr: Préférences
it: Preferenze
uk: Налаштування

source: About BMI
es: _Acerca BMI
fr: À propos d'IMC
it: Informazioni su BMI

source: Input
es: Entrada

source: Advanced mode
es: Modo avanzado
fr: Mode avancé
it: Modalità avanzata

source: Measurement system
es: Sistema de medición
fr: Système de mesure
it: Sistema di misurazione
uk: Система вимірювання

source: Metric
es: Métrico
fr: Métrique
it: Metrico
uk: Метрична

source: BMI
fr: IMC
uk: ІМТ

source: With the same height, this is what weight you need to get different BMI thresholds
fr: Avec la même taille, voici le poids dont vous avez besoin pour atteindre différents seuils d'IMC
uk: При однаковому зрості саме така вага потрібна, щоб отримати різні пороги ІМТ

source: Error setting preferences value
fr: Erreur lors de la définition de la valeur des préférences
uk: Помилка встановлення значення налаштувань

source: Imperial
fr: Impérial
it: Imperiale
uk: Імперська

source: Under {}
fr: Inférieur à {}
uk: До {}

source: Over {}
fr: Supérieur à {}
uk: Понад {}

source: From {} to {}
fr: De {} à {}
uk: Від {} до {}

source: Result
fr: Résultat

source: Thresholds
fr: Seuils
uk: Пороги

source: Additional context
fr: Contexte additionnel
uk: Додатковий контекст

source: lb
uk: фунт

source: kg
uk: кг
