Repository: PhilippKosarev/bmi
Catalog: po/*.po
Languages: es, fr, it, ru, uk, vi

source: We also created a convenience method that returns a list of supported actions of the currently selected accessible item - if it does not support the Action interface, it returns an empty list:
vi: Chúng ta cũng tạo một phương thức tiện ích trả về danh sách hành động được hỗ trợ của phần trợ năng đang chọn – nếu không hỗ trợ giao diện Action thì trả về danh sách rỗng:

source: def accSupportedActions(self): try: ai = self.node.acc.queryAction() except NotImplementedError: action_names = [] else: action_names = [ai.getName(i) for i in xrange(ai.nActions)] return action_names
vi: def accSupportedActions(self): try: try: ai = self.node.acc.queryAction() except NotImplementedError: action_names = [] else: action_names = [ai.getName(i) for i in range(ai.nActions)] return action_names

source: The base plugin class has a method call onAccChanged that is called everytime the target application's selected accessible item changes. We will override it setting the button to be sensitive only when the current accessible item has the "click" action:
vi: Lớp plugin cơ bản có phương thức onAccChanged được gọi mỗi khi phần trợ năng đang chọn thay đổi. Chúng ta ghi đè nó để chỉ bật nút khi phần trợ năng hiện tại có hành động "click":

source: The callback method for button "clicked" performs the "click" action on the accessible item. Since this callback could only be called when the button is sensitive, we don't need to worry about checking if the current accessible has the "click" action?
vi: Hàm gọi lại khi nhấn nút sẽ thực hiện hành động "click" trên phần trợ năng. Vì hàm này chỉ được gọi khi nút đang bật, nên không cần kiểm tra lại hành động "click".

source: def onClick(self, button): ai = self.node.acc.queryAction() action_names = [ai.getName(i) for i in xrange(ai.nActions)] ai.doAction(action_names.index('click'))
vi: def onClick(self, button): ai = self.node.acc.queryAction() action_names = [ai.getName(i) for i in range(ai.nActions)] ai.doAction(action_names.index('click'))

# link
source: Introduction to <app>Accerciser</app>
vi: Giới thiệu về <app>Accerciser</app>

source: <app>Accerciser</app>'s logo
vi: Logo của <app>Accerciser</app>

source: Before You Begin
vi: Trước khi bắt đầu

source: Read the <link xref="help:gnome-help/a11y">Universal Access Help</link>
vi: Đọc <link xref="help:gnome-help/a11y">Trợ giúp Truy cập phổ quát</link>

source: Getting Started
vi: Bắt đầu

source: Examining the Accessibility of an Application
vi: Kiểm tra khả năng trợ năng của ứng dụng

source: Advanced Topics
vi: Chủ đề nâng cao

# sort
source: 2. Interface Viewer Plugin
vi: 2. Trình xem giao diện

source: Examining your accessibility implementation
vi: Kiểm tra việc triển khai trợ năng của bạn

source: Interface Viewer Plugin
vi: Trình xem giao diện

source: The Interface Viewer Plugin shows the information and controls provided by the AT-SPI interfaces present in each accessible item from the <link xref="desktop_tree_view">Application Tree View</link>. After selecting an item, you can use this plugin to quickly review its supported interfaces, to retrieve each interface's information, and to manipulate the item through all the interface’s methods.
vi: Trình xem giao diện hiển thị thông tin và điều khiển mà các giao diện AT-SPI cung cấp cho mỗi phần trợ năng trong <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link>. Sau khi chọn một mục, bạn có thể dùng plugin này để nhanh chóng xem các giao diện được hỗ trợ, lấy thông tin từng giao diện và thao tác với mục qua các phương thức của giao diện.

source: Examining a Menu with the Interface Viewer Plugin
vi: Kiểm tra một Menu bằng Trình xem giao diện

source: Given a selected item in the Application Tree View, all of its AT-SPI interfaces will be shown as sensitive in the Interface Viewer Plugin. Those unsupported will appear grayed out, such as the Application and Collection interfaces in the figure above.
vi: Khi một mục được chọn trong Khung nhìn cây ứng dụng, tất cả giao diện AT-SPI của nó sẽ hiện hoạt trong Trình xem giao diện. Các giao diện không hỗ trợ sẽ bị làm mờ, ví dụ giao diện Application và Collection trong hình trên.

source: Running the Interface Viewer Plugin
vi: Chạy Trình xem giao diện

source: The first step to run the Interface Viewer Plugin is to select an item in the <link xref="desktop_tree_view"> Application Tree View</link>. After that, all AT-SPI interfaces covered by the plugin will be listed in the plugin's panel. The interfaces implemented by the selected item will be sensitive, so you can click each one of them to either retrieve their provided information or to interact with available methods. The following interfaces can be explored in <app>Accerciser</app>, assuming the selected item implements them:
vi: Bước đầu tiên để chạy Trình xem giao diện là chọn một mục trong <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link>. Sau đó, tất cả giao diện AT-SPI mà plugin hỗ trợ sẽ được liệt kê. Các giao diện được mục đã chọn triển khai sẽ hiện hoạt, bạn có thể nhấp vào từng giao diện để xem thông tin hoặc dùng các phương thức có sẵn. Các giao diện sau có thể khám phá trong <app>Accerciser</app> nếu mục đã chọn triển khai chúng:

source: Accessible - This interface shows the selected item's child count (number of child widgets), description, states, relations, and attributes.
vi: Accessible – Giao diện này hiển thị số lượng con (số widget con), mô tả, trạng thái, quan hệ và thuộc tính của mục đã chọn.

source: Action - This interface shows all the actions that can be performed by the selected item. For each interface, you will see its name, such as "press" or "click", followed by a description and a key binding, if there are any. If you select an action, a "Perform action" button will become sensitive. Press this button to see the item performing the selected action.
vi: Action – Hiển thị mọi hành động có thể thực hiện trên mục đã chọn. Với mỗi hành động, bạn sẽ thấy tên (như “press” hoặc “click”), mô tả và tổ hợp phím (nếu có). Khi chọn một hành động, nút “Thực hiện hành động” sẽ bật. Nhấn nút này để mục thực hiện hành động đã chọn.

source: Application - This interface can be implemented by items with role "application". It is worth to point out that items with role "application" not necessarily implement this interface. If the selected item implements it, the interface will show its ID and, if there are any, its toolkit and version.
vi: Application – Có thể được triển khai bởi các mục có vai trò “application”. Lưu ý không phải mọi mục có vai trò này đều triển khai giao diện này. Nếu có, sẽ hiển thị ID, bộ công cụ và phiên bản của ứng dụng.

source: Component - This interface shows the selected item's absolute position (with respect to the desktop coordinate system), relative position (with respect to the window coordinate system), size, layer type, MDI-Z-order (a short integer indicating the stacking order of the component in the MDI layer), and alpha (if alpha blending is used).
vi: Component – Hiển thị vị trí tuyệt đối (theo hệ tọa độ màn hình), vị trí tương đối (theo cửa sổ), kích thước, loại lớp, thứ tự xếp chồng MDI-Z-order và alpha (nếu dùng hòa trộn alpha).

source: Document - This interface shows the selected item's document attributes and locale description, if there is one.
vi: Document – Hiển thị thuộc tính tài liệu và mô tả ngôn ngữ địa phương của mục đã chọn (nếu có).

source: Hypertext - This interface shows a list with all the selected item's hypertext hyperlinks. For each hyperlink, the interface provides its name, URI, start (the index in the hypertext at which the hyperlink begins) and end (the index in the hypertext at which this hyperlink ends).
vi: Hypertext – Hiển thị danh sách tất cả siêu liên kết của mục đã chọn. Với mỗi liên kết, cung cấp tên, URI, chỉ số bắt đầu và kết thúc trong siêu văn bản.

source: Image - This interface shows the selected item's description (or "no description" if unspecified), size, position (with respect to the desktop coordinate system), and locale, if there is one.
vi: Image – Hiển thị mô tả (hoặc “không có mô tả” nếu chưa đặt), kích thước, vị trí (theo hệ tọa độ màn hình) và ngôn ngữ địa phương của mục ảnh.

source: Selection - This interface shows all selectable child items of the selected item. If the selected item is a menu bar with options "File", "Edit", "View", and "Help", and all of them are selectable, then they will be listed in this interface. If you click a listed option - "File", for example - and want to clear it, just press the "Clear" button below the list.
vi: Selection – Hiển thị tất cả mục con có thể chọn của mục đã chọn. Nếu mục là thanh menu có “Tệp”, “Sửa”, “Xem”, “Trợ giúp” và đều có thể chọn, chúng sẽ được liệt kê. Để bỏ chọn một mục (ví dụ “Tệp”), nhấn nút “Xóa” dưới danh sách.

source: Streamable Content - This interface shows the selected item's content types and their corresponding URIs.
vi: Streamable Content – Hiển thị các kiểu nội dung có thể truyền trực tuyến và URI tương ứng của mục đã chọn.

source: Table - This interface shows the selected item's caption and summary, rows (number of rows), columns (number of columns), selected rows (number of selected rows), and selected columns (number of selected columns). For a selected cell, the interface shows its row's and column's header and extents.
vi: Table – Hiển thị tiêu đề, tóm tắt, số hàng, số cột, số hàng/cột đang chọn của bảng. Với ô đã chọn, hiển thị tiêu đề hàng/cột và phạm vi.

source: TableCell - This interface shows the selected item's row and column index, row and column span, a list of the row and column header cells and the cell's table. By selecting a header cell in the list of row or column headers and pressing the "Show" button, it's possible to select that header cell object in Accerciser instead. Pressing the table button causes the table object to be selected.
vi: TableCell – Hiển thị chỉ số hàng/cột, độ trải hàng/cột, danh sách ô tiêu đề hàng/cột và bảng chứa ô. Chọn một ô tiêu đề và nhấn “Hiện” để chọn ô đó trong Accerciser. Nhấn nút bảng để chọn đối tượng bảng.

source: Text - This interface shows the selected item's text content, that can be editable, and its attributes. The basic attributes are offset (the number of characters the text has) and justification. To see possible CSS attributes, click the "Include defaults" check box.
vi: Text – Hiển thị nội dung văn bản (có thể chỉnh sửa) và thuộc tính. Thuộc tính tính cơ bản là offset (số ký tự) và căn lề. Để xem thuộc tính CSS, bật hộp kiểm “Bao gồm mặc định”.

source: Value - This interface shows the selected item's current value, minimum allowed value, maximum allowed value, and the minimum increment by which the value may be changed (or zero if this value cannot be determined). The current value can be manually changed via a spin button.
vi: Value – Hiển thị giá trị hiện tại, giá trị nhỏ nhất, lớn nhất và bước tăng nhỏ nhất của mục đã chọn (0 nếu không xác định). Giá trị hiện tại có thể thay đổi bằng nút xoay.

# sort
source: 1. What is Accerciser?
vi: 1. Accerciser là gì?

source: An interactive accessibility explorer
vi: Công cụ khám phá trợ năng tương tác

source: What is <app>Accerciser</app>?
vi: <app>Accerciser</app> là gì?

source: <app>Accerciser</app> is an interactive Python accessibility explorer. It uses the AT-SPI library to inspect, examine, and interact with widgets, allowing you to check if an application is providing correct information to assistive technologies and automated testing frameworks. <app>Accerciser</app> comes with a set of plugins that you can use to create custom views of accessibility information.
vi: <app>Accerciser</app> là công cụ khám phá trợ năng Python tương tác. Nó dùng thư viện AT-SPI để kiểm tra, khám phá và tương tác với các widget, giúp bạn kiểm tra xem ứng dụng có cung cấp thông tin đúng cho công nghệ hỗ trợ và khung kiểm thử tự động hay không. <app>Accerciser</app> đi kèm một bộ plugin cho phép tạo các khung nhìn tùy chỉnh về thông tin trợ năng.

source: By default, <app>Accerciser</app>'s main interface is comprised of three sections: a tree view of the entire desktop accessible hierarchy, namely <link xref="desktop_tree_view"> Application Tree View</link>, and two plugin areas. If you prefer to see all plugins in a single area, dividing <app>Accerciser</app>'s interface in two sections instead of three, press <keyseq><key>Ctrl</key><key>T</key></keyseq>. To re-divide it in three sections, press <keyseq><key>Ctrl</key><key>T</key></keyseq> again.
vi: Mặc định, giao diện chính của <app>Accerciser</app> gồm ba phần: khung nhìn cây toàn bộ cấu trúc trợ năng màn hình – gọi là <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link> – và hai vùng plugin. Nếu muốn gộp tất cả plugin vào một vùng (chia giao diện thành hai phần), nhấn <keyseq><key>Ctrl</key><key>T</key></keyseq>. Nhấn lại để trở về ba phần.

source: Make sure that accessibility support is enabled in your desktop - otherwise, <app>Accerciser</app> will not work as expected.
vi: Hãy chắc chắn rằng hỗ trợ trợ năng đã bật trên hệ thống của bạn – nếu không, <app>Accerciser</app> sẽ không hoạt động như mong đợi.

source: <app>Accerciser</app>'s default interface.
vi: Giao diện mặc định của <app>Accerciser</app>.

source: <app>Accerciser</app>'s intended audience
vi: Đối tượng sử dụng <app>Accerciser</app>

source: <app>Accerciser</app> fits the needs of many different audiences. User interface developers use it to ensure that their applications are providing all of their features through AT-SPI. Assistive technology developers are able to see what AT-SPI is providing to their applications. Automated UI test developers find <app>Accerciser</app> beneficial since it exposes different events that could be expected from their target application.
vi: <app>Accerciser</app> đáp ứng nhu cầu của nhiều đối tượng. Nhà phát triển giao diện dùng nó để đảm bảo ứng dụng cung cấp đầy đủ tính năng qua AT-SPI. Nhà phát triển công nghệ hỗ trợ có thể thấy AT-SPI cung cấp gì. Nhà phát triển kiểm thử tự động UI thấy hữu ích vì nó hiển thị các sự kiện có thể xảy ra từ ứng dụng mục tiêu.

source: <app>Accerciser</app>'s plugin architecture
vi: Kiến trúc plugin của <app>Accerciser</app>

source: <app>Accerciser</app> has an extensible, plugin-based architecture. Its core code is fairly small and most of its features are part of default plugins:
vi: <app>Accerciser</app> có kiến trúc dựa trên plugin, dễ mở rộng. Mã nguồn lõi rất nhỏ gọn, hầu hết tính năng nằm trong các plugin mặc định:

source: <link xref="interface_viewer_plugin">Interface Viewer</link> - A plugin that lets you explore the AT-SPI interfaces provided by each accessible widget of a target application.
vi: <link xref="interface_viewer_plugin">Trình xem giao diện</link> – Plugin cho phép khám phá các giao diện AT-SPI mà mỗi widget trợ năng của ứng dụng mục tiêu cung cấp.

source: <link xref="validator_plugin">AT-SPI Validator</link> - A plugin that applies tests to verify the accessibility of a target application.
vi: <link xref="validator_plugin">Bộ xác thực AT-SPI</link> – Plugin thực hiện các bài kiểm tra để xác minh khả năng trợ năng của ứng dụng mục tiêu.

source: <link xref="event_monitor_plugin">Event Monitor</link> - A plugin that displays AT-SPI events emitted by a target application as they occur.
vi: <link xref="event_monitor_plugin">Trình theo dõi sự kiện</link> – Plugin hiển thị sự kiện AT-SPI do ứng dụng mục tiêu phát ra khi chúng xảy ra.

source: <link xref="quick_select_plugin">Quick Select</link> - A plugin that provides global hotkeys for quickly selecting accessible widgets in <app>Accerciser</app>'s Application Tree View.
vi: <link xref="quick_select_plugin">Chọn nhanh</link> – Plugin cung cấp phím tắt toàn cục để nhanh chóng chọn widget trợ năng trong Khung nhìn cây ứng dụng của <app>Accerciser</app>.

source: <link xref="api_browser_plugin">API Browser</link> - A plugin that shows the interfaces, methods, and attributes available on each accessible widget of a target application.
vi: <link xref="api_browser_plugin">Trình duyệt API</link> – Plugin hiển thị giao diện, phương thức và thuộc tính có sẵn trên mỗi widget trợ năng của ứng dụng mục tiêu.

source: <link xref="ipython_plugin">IPython Console</link> - A plugin that provides a full, interactive Python shell with access to selected accessible widgets of a target application.
vi: <link xref="ipython_plugin">Console IPython</link> – Plugin cung cấp shell Python tương tác đầy đủ với quyền truy cập tới các widget trợ năng đã chọn của ứng dụng mục tiêu.

source: More about Accessibility
vi: Thêm về Trợ năng

source: Accessibility is a core value that should touch all aspects of a Desktop Environment. To help achieve it in GNOME, some libraries were developed, such as ATK and AT-SPI. Though originated in GNOME, these libraries are now also used in other Desktop Environments. To learn more about Accessibility Libraries for GNU/UNIX systems, you can consult:
vi: Trợ năng là giá trị cốt lõi cần hiện diện trong mọi khía cạnh của môi trường màn hình. Để đạt được điều này trong GNOME, một số thư viện đã được phát triển như ATK và AT-SPI. Dù bắt nguồn từ GNOME, các thư viện này hiện cũng được dùng trong các môi trường màn hình khác. Để tìm hiểu thêm về thư viện trợ năng cho hệ thống GNU/UNIX, bạn có thể tham khảo:

source: <link href="http://developer.gnome.org/atk/">ATK Accessibility Toolkit</link> - ATK provides the set of accessibility interfaces that are implemented by other toolkits and applications. Using the ATK interfaces, accessibility tools have full access to view and control running applications.
vi: <link href="http://developer.gnome.org/atk/">Bộ công cụ trợ năng ATK</link> – ATK cung cấp tập giao diện trợ năng được các bộ công cụ và ứng dụng khác triển khai. Nhờ giao diện ATK, công cụ trợ năng có thể xem và điều khiển hoàn toàn các ứng dụng đang chạy.

source: <link href="http://developer.gnome.org/at-spi-cspi/stable/">AT-SPI</link> - AT-SPI is the primary service interface by which assistive technologies query and receive notifications from running applications. Additional material is available from the <link href="http://accessibility.kde.org/developer/atk.php#coreclasses">KDE Accessibility Development Community</link>.
vi: <link href="http://developer.gnome.org/at-spi-cspi/stable/">AT-SPI</link> – AT-SPI là giao diện dịch vụ chính mà công nghệ hỗ trợ dùng để truy vấn và nhận thông báo từ ứng dụng đang chạy. Tài liệu bổ sung có tại <link href="http://accessibility.kde.org/developer/atk.php#coreclasses">Cộng đồng phát triển trợ năng KDE</link>.

source: <link href="https://help.gnome.org/users/gnome-help/stable/a11y.html">GNOME Desktop Accessibility Guide</link> - A guide for anyone interested in how the GNOME Desktop supports the needs of users with disabilities.
vi: <link href="https://help.gnome.org/users/gnome-help/stable/a11y.html">Hướng dẫn trợ năng Môi trường GNOME</link> – Hướng dẫn dành cho mọi người muốn biết cách Môi trường GNOME hỗ trợ người khuyết tật.

source: <link href="http://developer.gnome.org/accessibility-devel-guide/stable/">GNOME Accessibility Developer's Guide</link> - A guide for developers who want to ensure their applications are accessible to the widest audience of users.
vi: <link href="http://developer.gnome.org/accessibility-devel-guide/stable/">Hướng dẫn phát triển trợ năng GNOME</link> – Hướng dẫn dành cho nhà phát triển muốn đảm bảo ứng dụng của mình tiếp cận được nhiều người dùng nhất.

source: <link href="https://wiki.gnome.org/Accessibility">GNOME Accessibility Project</link> - The GNOME Accessibility Project includes the guides listed above along with many other useful links for users, developers and system administrators.
vi: <link href="https://wiki.gnome.org/Accessibility">Dự án trợ năng GNOME</link> – Dự án bao gồm các hướng dẫn trên cùng nhiều liên kết hữu ích khác cho người dùng, nhà phát triển và quản trị hệ thống.

# sort
source: 2. IPython Plugin
vi: 2. Plugin IPython

source: When all else fails
vi: Khi mọi cách khác đều thất bại

source: IPython Console Plugin
vi: Plugin Console IPython

source: The IPython Console Plugin allows real-time interaction with a selected item in the <link xref="desktop_tree_view"> Application Tree View</link>. Since the IPython Console Plugin is an interactive Python shell, you can import any Python modules you want.
vi: Plugin Console IPython cho phép tương tác thời gian thực với mục đã chọn trong <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link>. Vì đây là shell Python tương tác, bạn có thể nhập bất kỳ module Python nào cần thiết.

source: Make sure you have the standalone package IPython installed in your system. Otherwise, the IPython Console Plugin will not work properly.
vi: Đảm bảo đã cài gói IPython độc lập trên hệ thống. Nếu không, Plugin Console IPython sẽ không hoạt động đúng.

source: Running the IPython Console Plugin
vi: Chạy Plugin Console IPython

source: To run the IPython Console Plugin, select one of the accessible items listed in the Application Tree View - either an application or a widget. In the plugin, the selected item will correspond to the variable 'acc'.
vi: Để chạy Plugin Console IPython, chọn một mục trợ năng trong Khung nhìn cây ứng dụng (ứng dụng hoặc widget). Trong plugin, mục đã chọn sẽ tương ứng với biến 'acc'.

source: Pressing <key>Tab</key> shows completions for the current command in the console, what can be useful for discovering pyatspi methods.
vi: Nhấn <key>Tab</key> sẽ hiển thị gợi ý hoàn thành lệnh hiện tại – rất hữu ích ích để khám phá các phương thức pyatspi.

source: Investigating selected items with the IPython Console Plugin
vi: Khám phá các mục đã chọn bằng Plugin Console IPython

source: The IPython Console Plugin lets you investigate methods, constants, and properties related to a selected item in the Application Tree View.
vi: Plugin Console IPython cho phép khám phá các phương thức, hằng số và thuộc tính liên quan đến mục đã chọn trong Khung nhìn cây ứng dụng.

source: Typing <cmd>help(acc)</cmd> in the IPython Console Plugin shows some useful documentation about the corresponding selected accessible item.
vi: Gõ <cmd>help(acc)</cmd> trong Plugin Console IPython sẽ hiển thị tài liệu hữu ích về mục trợ năng đang chọn.

# sort
source: 4. Preferences
vi: 4. Tùy chỉnh

source: Customizing <app>Accerciser</app>'s preferences
vi: Tùy chỉnh tùy chọn của <app>Accerciser</app>

source: Configuring <app>Accerciser</app>
vi: Cấu hình <app>Accerciser</app>

source: To configure plugins, hotkeys, and highlighting, do either <keyseq><key>Ctrl</key><key>P</key></keyseq> or <guiseq><gui>Chỉnh sửa</gui><gui>Tùy chọn</gui></guiseq> to open a dialog.
vi: Để cấu hình plugin, phím tắt và đánh dấu, dùng <keyseq><key>Ctrl</key><key>P</key></keyseq> hoặc <guiseq><gui>Chỉnh sửa</gui><gui>Tùy chọn</gui></guiseq> để mở hộp thoại.

source: Configuring plugins
vi: Cấu hình plugin

source: After opening the Preferences Dialog, you will find a list of all available plugins, with corresponding checkboxes, under the "Plugins" tab. To enable or disable a plugin, toggle its checkbox. Only active plugins can be accessed via <app>Accerciser</app>'s interface.
vi: Sau khi mở hộp thoại Tùy chọn, bạn sẽ thấy danh sách tất cả plugin có sẵn kèm hộp kiểm trong tab “Plugin”. Để bật/tắt plugin, chọn hoặc bỏ chọn hộp kiểm. Chỉ các plugin đang bật mới xuất hiện trong giao diện <app>Accerciser</app>.

source: Right-clicking on any given plugin allows you to choose its location: "Top Panel", "Bottom Panel", and "New View". Selecting "New View" creates a new window for the plugin.
vi: Nhấp phải vào plugin bất kỳ cho phép chọn vị trí: “Bảng trên”, “Bảng dưới” và “Cửa sổ mới”. Chọn “Cửa sổ mới” sẽ tạo cửa sổ riêng cho plugin đó.
