Repository: PhilippKosarev/bmi
Catalog: po/*.po
Languages: es, fr, it, ru, uk, vi

# _
source: translator-credits
vi: Vietnam Linux L10n <https://github.com/linux-l10n-vi> Loc Huynh <https://github.com/hthienloc>

# sort
source: 1. API Browser Plugin
vi: 1. Trình duyệt API

source: Verifying interfaces, methods, and properties
vi: Kiểm tra giao diện, phương thức và thuộc tính

source: API Browser Plugin
vi: Trình duyệt API

source: Given an accessible widget selected in the <link xref="desktop_tree_view">Application Tree View</link>, the API Browser Plugin shows its implemented AT-SPI interfaces along with its methods and properties.
vi: Khi một widget trợ năng được chọn trong <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link>, Trình duyệt API sẽ hiển thị các giao diện AT-SPI mà nó triển khai cùng với các phương thức và thuộc tính tương ứng.

source: The API Browser Plugin allows you to verify interfaces, methods, and properties of a target accessible widget in an application.
vi: Trình duyệt API cho phép kiểm tra giao diện, phương thức và thuộc tính của một widget trợ năng mục tiêu trong ứng dụng.

source: Running the API Browser Plugin
vi: Chạy Trình duyệt API

source: To run the API Browser Plugin, select an accessible widget in the Application Tree View. Double-clicking a widget highlights it in the application's interface, so you can be sure whether a certain widget were the one you were looking for.
vi: Để chạy Trình duyệt API, chọn một widget trợ năng trong Khung nhìn cây ứng dụng. Nhấp đúp vào widget sẽ làm nổi bật nó trong giao diện ứng dụng, giúp bạn chắc chắn đó có phải là widget đang tìm hay không.

source: After that, select one of the widget's interfaces in the combobox. All public methods of the selected interface will be listed in the plugin's leftmost column. All public properties, with their corresponding values, will be listed in the plugin's rightmost column.
vi: Sau đó, chọn một trong các giao diện của widget từ hộp chọn. Tất cả phương thức công khai của giao diện đã chọn sẽ được liệt kê ở cột bên trái của plugin. Tất cả thuộc tính công khai cùng giá trị tương ứng sẽ được liệt kê ở cột bên phải.

source: By default, the API Browser Plugin hides private methods and properties. To see them listed, unselect the checkbox <cmd>Hide Private Attributes</cmd>. To hide them again, re-select this checkbox.
vi: Mặc định, Trình duyệt API ẩn các phương thức và thuộc tính riêng tư. Để hiển thị chúng, bỏ chọn hộp kiểm <cmd>Ẩn thuộc tính riêng tư</cmd>. Để ẩn lại, chọn lại hộp kiểm này.

# sort
source: 1. Application Tree View
vi: 1. Khung nhìn cây ứng dụng

source: Exploring the accessible hierarchy of the desktop
vi: Khám phá cấu trúc phân cấp trợ năng của màn hình

source: Application Tree View
vi: Khung nhìn cây ứng dụng

source: <app>Accerciser</app>'s interface contains a tree view, namely Application Tree View, that covers all accessible applications currently running on the desktop. To create this tree view, <app>Accerciser</app> uses the AT-SPI's registry daemon. This daemon is responsible for keeping track of all the accessible applications on the desktop and forwarding X events over the AT-SPI D-Bus. After getting all accessible applications, <app>Accerciser</app> represents each one of them as a hierarchical structure with expanding nodes.
vi: Giao diện của <app>Accerciser</app> chứa một khung nhìn cây, gọi là Khung nhìn cây ứng dụng, bao quát tất cả ứng dụng trợ năng đang chạy trên màn hình. Để tạo khung nhìn này, <app>Accerciser</app> sử dụng daemon đăng ký của AT-SPI. Daemon này chịu trách nhiệm theo dõi mọi ứng dụng trợ năng trên màn hình và chuyển tiếp các sự kiện X qua AT-SPI D-Bus. Sau khi thu thập, <app>Accerciser</app> biểu diễn mỗi ứng dụng dưới dạng cấu trúc phân cấp có thể mở rộng.

source: <app>Accerciser</app>'s Application Tree View represents the interface of each accessible application running on the desktop as a widget hierarchical structure.
vi: Khung nhìn cây ứng dụng của <app>Accerciser</app> biểu diễn giao diện của mỗi ứng dụng trợ năng đang chạy dưới dạng cấu trúc phân cấp widget.

source: The first node of each application represented in this tree view is the application itself. When you expand a node, you can see all of its child widgets, which allows a hierarchical view of the application's interface. For each node, <app>Accerciser</app> provides some basic information, such as its name, role and number of children.
vi: Nút đầu tiên của mỗi ứng dụng trong khung nhìn cây này chính là ứng dụng đó. Khi mở rộng một nút, bạn sẽ thấy tất cả widget con của nó, cho phép xem phân cấp giao diện ứng dụng. Với mỗi nút, <app>Accerciser</app> cung cấp một số thông tin cơ bản như tên, vai trò và số lượng con.

source: Be aware that nodes with many children take a long time to expand.
vi: Lưu ý rằng các nút có nhiều con sẽ mất nhiều thời gian để mở rộng.

source: Bookmarking items in the Application Tree View
vi: Đánh dấu mục trong Khung nhìn cây ứng dụng

source: <app>Accerciser</app> allows bookmarking items in the Application Tree View for later examining. This is helpful when the target application must be restarted - after rebuilding it, for example. To bookmark an item, select it and do <guiseq><gui>Bookmarks</gui><gui>Add Bookmark</gui></guiseq> or press <keyseq><key>Ctrl</key><key>d</key></keyseq>.
vi: <app>Accerciser</app> cho phép đánh dấu các mục trong Khung nhìn cây ứng dụng để xem lại sau. Điều này hữu ích khi ứng dụng mục tiêu cần khởi động lại – ví dụ sau khi biên dịch lại. Để đánh dấu, chọn mục và thực hiện <guiseq><gui>Bookmarks</gui><gui>Thêm đánh dấu</gui></guiseq> hoặc nhấn <keyseq><key>Ctrl</key><key>D</key></keyseq>.

source: Bookmarks to accessible items in <app>Accerciser</app> are defined by an application name and a "path" in the application's internal accessible hierarchy to the bookmarked accessible. When the target application is in a different state - i.e. multiple top level frames -, the path might not be correct. Bookmarks could be managed by accessing the bookmark editing dialog through <guiseq><gui>Bookmarks</gui><gui>Edit Bookmarks</gui></guiseq>.
vi: Đánh dấu trong <app>Accerciser</app> được xác định bởi tên ứng dụng và “đường dẫn” trong cấu trúc trợ năng nội bộ tới mục đã đánh dấu. Khi ứng dụng mục tiêu ở trạng thái khác – ví dụ nhiều khung cấp cao – đường dẫn có thể không đúng. Các đánh dấu có thể được quản lý qua hộp thoại chỉnh sửa bằng <guiseq><gui>Bookmarks</gui><gui>Chỉnh sửa đánh dấu</gui></guiseq>.

# sort
source: 4. Event Monitor Plugin
vi: 4. Trình theo dõi sự kiện

source: Monitoring accessible events as they occur
vi: Theo dõi các sự kiện trợ năng khi chúng xảy ra

source: Event Monitor Plugin
vi: Trình theo dõi sự kiện

source: The Event Monitor Plugin allows you to view <link href="http://accessibility.linuxfoundation.org/a11yspecs/atspi/adoc/atspi-events.html">AT-SPI events</link> as they occur on the applications exposed in <app>Accerciser</app>'s <link xref="desktop_tree_view">Application Tree View</link>. The plugin is useful to explore the dynamics of an application's interface and verify which accessible widgets are related to which AT-SPI events.
vi: Trình theo dõi sự kiện cho phép xem các <link href="http://accessibility.linuxfoundation.org/a11yspecs/atspi/adoc/atspi-events.html">sự kiện AT-SPI</link> khi chúng xuất hiện trong các ứng dụng được hiển thị ở <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link> của <app>Accerciser</app>. Plugin này hữu ích để khám phá động thái giao diện ứng dụng và xác định widget trợ năng nào liên quan đến sự kiện AT-SPI nào.

source: The Event Monitor Plugin allows you to view AT-SPI events and match them with accessible widgets.
vi: Trình theo dõi sự kiện cho phép xem sự kiện AT-SPI và đối chiếu chúng với các widget trợ năng.

source: Running the Event Monitor Plugin
vi: Chạy Trình theo dõi sự kiện

source: When you open the Event Monitor Plugin, you see a list of checkboxes representing all the different AT-SPI event classes covered by the plugin:
vi: Khi mở Trình theo dõi sự kiện, bạn sẽ thấy danh sách các hộp kiểm biểu thị tất cả các lớp sự kiện AT-SPI mà plugin hỗ trợ:

source: document
vi: tài liệu

source: focus
vi: tiêu điểm

source: mouse
vi: chuột

source: object
vi: đối tượng

source: window
vi: cửa sổ

source: If you check a class, all of its event types will be monitored by the plugin. The classes are exposed as tree structures; therefore, you can refine your selection by expanding them and checking only the event types you really care about.
vi: Nếu chọn một lớp, tất cả kiểu sự kiện thuộc lớp đó sẽ được theo dõi. Các lớp được hiển thị dưới dạng cây, vì vậy bạn có thể mở rộng và chỉ chọn những kiểu sự kiện cần quan tâm.

source: If you want to monitor all possible types of AT-SPI events, press the <cmd>Select All</cmd> button. Similarly, if you want to clear all currently selected event types, press the <cmd>Clear Selection</cmd> button.
vi: Nếu muốn theo dõi mọi kiểu sự kiện AT-SPI, nhấn nút <cmd>Chọn tất cả</cmd>. Tương tự, để bỏ chọn hết, nhấn nút <cmd>Xóa lựa chọn</cmd>.

source: Selecting only a few event types per monitoring gives you a clearer output.
vi: Chỉ chọn một vài kiểu sự kiện mỗi lần theo dõi sẽ cho kết quả rõ ràng hơn.

source: Another way to refine event monitoring is by the event source. By default, the Source option <cmd>Everything</cmd> is selected, indicating that AT-SPI events of all applications will be monitored. If you want to investigate a single application, select it in the Application Tree View and click the Source radio button <cmd>Selected application</cmd>. Likewise, if you want to monitor a single accessible widget and its corresponding descendants, select it in the Application Tree View and click the Source radio button <cmd>Selected accessible</cmd>.
vi: Cách khác để lọc là theo nguồn sự kiện. Mặc định là <cmd>Mọi thứ</cmd>, tức theo dõi sự kiện từ mọi ứng dụng. Để chỉ theo dõi một ứng dụng, chọn ứng dụng trong Khung nhìn cây ứng dụng rồi chọn nút radio <cmd>Ứng dụng đã chọn</cmd>. Tương tự, để theo dõi một widget trợ năng và các phần tử con, chọn widget đó và chọn nút radio <cmd>Phần trợ năng đã chọn</cmd>.

source: After selecting event types and specifying a Source option, the Event Monitor Plugin starts monitoring AT-SPI events automatically, because the <cmd>Monitor Events</cmd> button is pressed by default. Whenever you want to stop monitoring, click the <cmd>Monitor Events</cmd> button. To restart monitoring, press this button again.
vi: Sau khi chọn kiểu sự kiện và nguồn, Trình theo dõi sự kiện sẽ tự động bắt đầu theo dõi vì nút <cmd>Theo dõi sự kiện</cmd> đã được bật mặc định. Để dừng, nhấn lại nút này. Để tiếp tục, nhấn lại lần nữa.

source: For each incoming event, the Event Monitor Plugin indicates the source and the application. Activating the link for either of these items will cause it to become selected in the Application Tree View.
vi: Với mỗi sự kiện đến, plugin sẽ hiển thị nguồn và ứng dụng. Kích hoạt liên kết của nguồn hoặc ứng dụng sẽ làm mục đó được chọn trong Khung nhìn cây ứng dụng.

source: If you want to save the output generated by the Event Monitor Plugin, just press the <cmd>Save</cmd> button. To clear the output screen, you just need to click the <cmd>Clear</cmd> button.
vi: Để lưu kết quả của Trình theo dõi sự kiện, nhấn nút <cmd>Lưu</cmd>. Để xóa màn hình kết quả, nhấn nút <cmd>Xóa</cmd>.

# sort
source: 2. How to install and run <app>Accerciser</app>
vi: 2. Cách cài đặt và chạy <app>Accerciser</app>

# link
source: Setting up <app>Accerciser</app>
vi: Cài đặt <app>Accerciser</app>

source: Installing and running <app>Accerciser</app> on your system
vi: Cài đặt và chạy <app>Accerciser</app> trên hệ thống của bạn

source: Setting up <app>Accerciser</app>
vi: Cài đặt <app>Accerciser</app>

source: Check if your distribution has <app>Accerciser</app> already packaged. If this is the case, you can install it via its package manager. Otherwise, you can follow the section below to install <app>Accerciser</app> manually.
vi: Kiểm tra xem bản phân phối của bạn đang dùng đã có gói <app>Accerciser</app> hay chưa. Nếu có, bạn có thể cài qua trình quản lý gói. Nếu không, hãy làm theo phần dưới để cài thủ công.

source: Installing <app>Accerciser</app> manually
vi: Cài <app>Accerciser</app> thủ công

source: To install <app>Accerciser</app> manually, you will need to download it first. <app>Accerciser</app>'s source code can either be downloaded from <link href="http://ftp.gnome.org/pub/GNOME/sources/accerciser/">the gnome.org FTP site</link> or cloned from <link href="https://gitlab.gnome.org/GNOME/accerciser">the gnome.org GIT repository</link>.
vi: Để cài <app>Accerciser</app> thủ công, trước tiên bạn cần tải mã nguồn. Mã nguồn của <app>Accerciser</app> có thể tải từ <link href="http://ftp.gnome.org/pub/GNOME/sources/accerciser/">trang FTP gnome.org</link> hoặc clone từ <link href="https://gitlab.gnome.org/GNOME/accerciser">kho GIT gnome.org</link>.

source: If you are not using GNOME 3, you may find that <app>Accerciser</app> version 3 or later is not compatible with your environment.
vi: Nếu bạn không dùng GNOME 3, phiên bản <app>Accerciser</app> 3 trở lên có thể không tương thích với môi trường của bạn.

source: After getting <app>Accerciser</app>, install it using the following commands:
vi: Sau khi tải <app>Accerciser</app>, cài đặt bằng các lệnh sau:

source: <cmd>sudo meson install -C _build # or meson install -C _build as root</cmd>
vi: <cmd>sudo meson install -C _build # hoặc meson install -C _build với quyền root</cmd>

source: If you find any problems installing <app>Accerciser</app> on your system, it is likely that some of its dependencies are missing. Check <link href="https://live.gnome.org/Accerciser/#Requirements"> <app>Accerciser</app>'s wiki</link> to make sure you have all dependencies properly installed.
vi: Nếu gặp vấn đề khi cài <app>Accerciser</app>, có thể thiếu một số gói phụ thuộc. Hãy xem <link href="https://live.gnome.org/Accerciser/#Requirements">wiki của <app>Accerciser</app></link> để đảm bảo đã cài đủ các gói phụ thuộc.

source: Running <app>Accerciser</app>
vi: Chạy <app>Accerciser</app>

source: To start <app>Accerciser</app>, type <cmd>accerciser</cmd> in a terminal window or within the Run dialog and then press <key>Return</key>.
vi: Để khởi động <app>Accerciser</app>, gõ <cmd>accerciser</cmd> trong cửa sổ terminal hoặc hộp thoại Chạy rồi nhấn <key>Enter</key>.

source: After that, you can use <app>Accerciser</app> to inspect any accessible item shown in the <link xref="desktop_tree_view">Application Tree View</link>'s hierarchy. Select an item and investigate it using one of <app>Accerciser</app>'s plugins.
vi: Sau đó, bạn có thể dùng <app>Accerciser</app> để kiểm tra bất kỳ phần trợ năng nào hiển thị trong cấu trúc phân cấp của <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link>. Chọn một mục và khám phá nó bằng một trong các plugin của <app>Accerciser</app>.

# sort
source: 3. Writing New Plugins
vi: 3. Viết plugin mới

source: Extending <app>Accerciser</app> with your desired functionalities
vi: Mở rộng <app>Accerciser</app> bằng các tính năng bạn muốn

source: Writing Plugins for <app>Accerciser</app>
vi: Viết plugin cho <app>Accerciser</app>

source: Extending <app>Accerciser</app> with new plugins became much simpler since <link href="https://wiki.gnome.org/Apps/Accerciser/PluginTutorial">this tutorial</link> was written. Given that it provides a very detailed explanation about the topic, this section consists basically of its original content - only simple editions and updates were done.
vi: Việc mở rộng <app>Accerciser</app> bằng plugin mới đã trở nên đơn giản hơn nhiều kể từ khi <link href="https://wiki.gnome.org/Apps/Accerciser/PluginTutorial">hướng dẫn này</link> được viết. Vì hướng dẫn đó đã giải thích rất chi tiết, phần này chủ yếu giữ nguyên nội dung gốc – chỉ thực hiện một số chỉnh sửa và cập nhật nhỏ.

source: <app>Accerciser</app> supports three basic types of plugins:
vi: <app>Accerciser</app> hỗ trợ ba kiểu plugin cơ bản:

source: Base plugins - These plugins are derived from the Plugin base class. They do not provide a visible interface, but could provide additional functionality to <app>Accerciser</app>.
vi: Plugin cơ bản – Các plugin này kế thừa từ lớp Plugin. Chúng không hiển thị giao diện, nhưng có thể cung cấp tính năng bổ sung cho <app>Accerciser</app>.

source: Console plugins - These plugins provide simple console output into a text area in a plugin tab. Not to be confused with the packaged <link xref="ipython_plugin">IPython Console Plugin</link>.
vi: Plugin console – Các plugin này xuất kết quả dạng console vào vùng văn bản trong tab plugin. Không nhầm lẫn với <link xref="ipython_plugin">Plugin Console IPython</link> đi kèm.

source: Viewport plugins - The majority of <app>Accerciser</app> default plugins. They provide a custom graphical interface in a tab.
vi: Plugin viewport – Phần lớn plugin mặc định của <app>Accerciser</app>. Chúng cung cấp giao diện đồ họa tùy chỉnh trong một tab.

source: Creating a Base Plugin
vi: Tạo plugin cơ bản

source: We will create a simplified version of the <link xref="quick_select_plugin">Quick Select Plugin</link>. This plugin will select the last focused accessible when pressing <keyseq><key>Ctrl</key><key>Alt</key><key>e</key></keyseq>.
vi: Chúng ta sẽ tạo một phiên bản đơn giản của <link xref="quick_select_plugin">Plugin Chọn nhanh</link>. Plugin này sẽ chọn phần trợ năng cuối cùng nhận tiêu điểm khi nhấn <keyseq><key>Ctrl</key><key>Alt</key><key>E</key></keyseq>.

source: First off, the import lines we will use are:
vi: Trước tiên, các dòng import cần dùng là:

source: Next we will derive a new class from the Plugin base class, and assign some mandatory class attributes:
vi: Tiếp theo, chúng ta tạo lớp mới kế thừa từ lớp Plugin và gán một số thuộc tính lớp bắt buộc:

source: class FocusSelect(Plugin): plugin_name = 'Focus Select' plugin_description = 'Allows selecting last focused accessible.'
vi: class FocusSelect(Plugin): plugin_name = 'Chọn tiêu điểm' plugin_description = 'Cho phép chọn phần trợ năng cuối cùng nhận tiêu điểm.'

source: We will now override the init method, in which we will set a global key action for selecting the last focused accessible item, register an event listener for the "focus" event, and set the <cmd>last_focused</cmd> instance variable to <cmd>None</cmd>.
vi: Bây giờ chúng ta ghi đè phương thức init, trong đó đặt phím tắt toàn cục để chọn phần trợ năng cuối cùng nhận tiêu điểm, đăng ký lắng nghe sự kiện "focus", và đặt biến thể hiện <cmd>last_focused</cmd> thành <cmd>None</cmd>.

source: def init(self): pyatspi.Registry.registerEventListener(self.accEventFocusChanged, 'focus') self.global_hotkeys = [('Inspect last focused accessible', self.inspectLastFocused, gtk.keysyms.e, gtk.gdk.CONTROL_MASK | gtk.gdk.MOD1_MASK)] self.last_focused = None
vi: def init(self): pyatspi.Registry.registerEventListener(self.accEventFocusChanged, 'focus') self.global_hotkeys = [('Kiểm tra phần trợ năng cuối cùng nhận tiêu điểm', self.inspectLastFocused, gtk.keysyms.e, gtk.gdk.CONTROL_MASK | gtk.gdk.MOD1_MASK)] self.last_focused = None

source: Notice that the <cmd>global_hotkeys</cmd> instance variable is a list of tuples. Each tuple is a global hotkey action, composed by an action description, a desired method to call, a key symbol of keypress, and a key modifier mask.
vi: Lưu ý biến thể hiện <cmd>global_hotkeys</cmd> là danh sách các tuple. Mỗi tuple là một hành động phím tắt toàn cục, gồm mô tả hành động, phương thức cần gọi, ký hiệu phím và mặt nạ phím điều khiển.

source: In the "focus" event callback, we assign the <cmd>last_focused</cmd> instance variable with the accessible item that has just emitted the "focus" event.
vi: Trong hàm gọi lại của sự kiện "focus", chúng ta gán biến <cmd>last_focused</cmd> bằng phần tử trợ năng vừa phát ra sự kiện "focus".

source: In the hotkey action callback, we update the application wide node with the last focused accessible item, if we have recorded it:
vi: Trong hàm gọi lại của phím tắt, chúng ta cập nhật nút toàn ứng dụng bằng phần trợ năng cuối cùng nhận tiêu điểm nếu đã ghi nhận:

source: Creating a Console Plugin
vi: Tạo plugin console

source: We will create a console plugin to display focus changes emitted by an accessible item with a "push button" role - remember that it is easy to check what is the role of any item with <app>Accerciser</app>; you can verify it in the <link xref="desktop_tree_view">Application Tree View</link>, for example.
vi: Chúng ta sẽ tạo một plugin console hiển thị thay đổi tiêu điểm từ phần trợ năng có vai trò “push button” – nhớ rằng rất dễ kiểm tra vai trò của bất kỳ mục nào bằng <app>Accerciser</app>, ví dụ trong <link xref="desktop_tree_view">Khung nhìn cây ứng dụng</link>.

source: The needed import lines are:
vi: Các dòng import cần thiết là:

source: Then we add a class definition, with a plugin name and description:
vi: Sau đó thêm định nghĩa lớp kèm tên và mô tả plugin:

source: class PushButtonFocus(ConsolePlugin): plugin_name = 'Push Button Focus' plugin_description = 'Print event when pushbutton get\'s focus.'
vi: class PushButtonFocus(ConsolePlugin): plugin_name = 'Tiêu điểm nút bấm' plugin_description = 'In sự kiện khi nút bấm nhận tiêu điểm.'

source: We override the init method adding a register listener:
vi: Ghi đè phương thức init và thêm đăng ký lắng nghe sự kiện:

source: In the callback method, all push button events are printed.
vi: Trong hàm gọi lại, tất cả sự kiện của nút bấm sẽ được in ra.

source: Creating a Viewport Plugin
vi: Tạo plugin viewport

source: We will create a viewport plugin that allows quick testing of the "click" action in accessible items that support the AT-SPI Action interface and have an action named "click". It will be a simple button that, once clicked, does the "click" action in the accessible.
vi: Chúng ta sẽ tạo một plugin viewport cho phép thử nhanh hành động "click" trên các phần trợ năng hỗ trợ giao diện Action của AT-SPI và có hành động tên là "click". Đó sẽ là một nút đơn giản, khi nhấn sẽ thực hiện hành động "click" trên phần trợ năng.

source: First off, some mandatory import lines:
vi: Trước hết, các dòng import bắt buộc:

source: Next, a class definition, with a name and description:
vi: Tiếp theo, định nghĩa lớp kèm tên và mô tả:

source: class Clicker(ViewportPlugin): plugin_name = 'Clicker' plugin_description = 'Test the "click" action in relevant accessibles.'
vi: class Clicker(ViewportPlugin): plugin_name = 'Nhấn thử' plugin_description = 'Thử hành động “nhấn” trên các phần trợ năng hỗ trợ.'

source: We override the init method with some UI building, and connecting a callback to a signal for the button. We set the alignment to allow the button to be centered in the plugin tab, and not monstrously take up the entire plugin space. Notice that the <cmd>plugin_area</cmd> instance variable contains a gtk.Frame that could be populated with all the plugin's widgets.
vi: Ghi đè phương thức init để tạo giao diện và kết nối callback cho nút. Đặt căn giữa để nút nằm giữa tab plugin thay vì chiếm hết không gian. Biến <cmd>plugin_area</cmd> chứa một gtk.Frame có thể chứa mọi widget của plugin.

source: def init(self): self.click_button = gtk.Button('Click me!') self.click_button.set_halign(gtk.Align.CENTER) self.click_button.set_valign(gtk.Align.CENTER) self.plugin_area.add(self.click_button) self.click_button.connect('clicked', self.onClick) self.show_all()
vi: def init(self): self.click_button = gtk.Button('Nhấn thử!') self.click_button.set_halign(gtk.Align.CENTER) self.click_button.set_valign(gtk.Align.CENTER) self.plugin_area.add(self.click_button) self.click_button.connect('clicked', self.onClick) self.show_all()
